egormeister02/Ultrasonic-LNS/src/ground_node/sdkconfig.defaults
# Target chip (pin it so a fresh configure doesn't default to esp32)
CONFIG_IDF_TARGET="esp32s3"

# Console on native USB (USB-Serial-JTAG) so logs reach /dev/ttyACM0
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
